IDEA Open Model
CheckResConcreteBlock Class
Compatible with IDEA StatiCa 20.1
 Check value for Concrete Block
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.CheckResConcreteBlock
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
[SerializableAttribute]
public class CheckResConcreteBlock
<SerializableAttribute>
Public Class CheckResConcreteBlock
The CheckResConcreteBlock type exposes the following members.
Constructors
Name | Description
CheckResConcreteBlock
Initializes a new instance of the CheckResConcreteBlock class
Top
Properties
Name | Description
CheckStatus
 Status of the Check
LoadCaseId
 Id of Load Case
Name
 Name of Concrete Block
UnityCheck
 Unity Check
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace